Tekla.Structures.Model.GeometrySection
The GeometrySection class represents geometry node with its identifier.

Tekla.Structures.Model.GeometrySection.index
The index of the section.

Tekla.Structures.Model.GeometrySection.node
The geometry section.

Tekla.Structures.Model.GeometrySection.#ctor(System.Int32,Tekla.Structures.Model.IGeometryNode)
Initializes a new instance of the Tekla.Structures.Model.GeometrySection class.
index: The index of the node.
node: The geometry node.

Tekla.Structures.Model.GeometrySection.Index
Gets the index of the node

Tekla.Structures.Model.GeometrySection.GeometryNode
Gets the geometry node